fonecmid-diplom/src/Documents/ВКМ_ВходящийHTTPЗапрос/ВКМ_ВходящийHTTPЗапрос.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВходящийHTTPЗапрос</name>
  <posting>Deny</posting>
  <attributes>
    <name>ТелоЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_ОбщегоНазначенияHTTP/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СтрокаJSON(ОбъектJSON) Экспорт
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON (, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись,ОбъектJSON);
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ОбъектJSON(СтрокаJSON) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат ОбъектJSON;
	
КонецФункции


Функция ОтветJSON (Объект, КодСостояния = 200) Экспорт 
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON(Объект));
	Ответ.Заголовки.Вставить("Content-Type",ТипКонтентаJSON());
	
	Возврат Ответ;
КонецФункции


Функция ПростойУспешныйОтвет() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Result","Ok");
	
	Возврат ОтветJSON(Результат);
	
КонецФункции

Функция ПростойОтрицательныйОтвет() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Result","Error");
	Результат.Вставить("ErrorText","WrongSecret");
	
	Возврат ОтветJSON(Результат);
	
КонецФункции

Функция ОбработатьИнформациюОбОшибкеWebСервиса(СтрокаОшибки,Знач ИнформацияОбОшибке, Знач ИмяПодсистемы = "", Знач ИмяВебСервиса = "", Знач ИмяОперации = "") Экспорт
	
	
	Если ИнформацияОбОшибке = Неопределено Тогда
		Возврат ПростойУспешныйОтвет();
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяПодсистемы) Тогда
		ИмяПодсистемы = Метаданные.Подсистемы.ВКМ_ДобавленныеОбъекты.Подсистемы.ВКМ_ОбслуживаниеКлиента.Имя;
	КонецЕсли;
	
	ИмяСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = '%1.Ошибка вызова операции web-сервиса'", ОбщегоНазначения.КодОсновногоЯзыка()),
	ИмяПодсистемы);
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Ошибка при вызове операции %1 веб-сервиса %2: %3. Тело ответа %4'", ОбщегоНазначения.КодОсновногоЯзыка()),
	ИмяОперации,
	ИмяВебСервиса,
	ИнформацияОбОшибке.ДополнительнаяИнформация,
	СтрокаОшибки);
	
	ЗаписьЖурналаРегистрации(
	ИмяСобытия,
	УровеньЖурналаРегистрации.Ошибка,
	,
	,
	ТекстОшибки);
	
	
	Результат = Новый Структура;
	Результат.Вставить("Result","Error");
	Результат.Вставить("ErrorText",КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	
	
	Возврат ОтветJSON(Результат,500);
	
КонецФункции


Процедура ЗаписьЛога (Метод,Запрос,Ответ) Экспорт
	
	ДокОбъкт = Документы.ВКМ_ВходящийHTTPЗапрос.СоздатьДокумент();
	ДокОбъкт.Метод = Метод;
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		ТелоЗапроса = СтрокаJSON(ОбъектJSON(ТелоЗапроса));	
	Исключение

	КонецПопытки;
	
	
	ДокОбъкт.КодСостояния = Ответ.КодСостояния;
	ДокОбъкт.ТелоЗапроса = ТелоЗапроса;
	ДокОбъкт.Дата = ТекущаяДатаСеанса();
	
	ДокОбъкт.Записать();
	
КонецПроцедуры 


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТипКонтентаJSON() Экспорт
	Возврат "application/json";
КонецФункции

#КонецОбласти
